Autodesk.Revit.DB.Document.Update(System.String,Autodesk.Revit.DB.ATFXMLImportOptions)
Updates the Revit project document, that was created by an import of an ATF XML file.
file:
Full path of the file to update. File must exist and must be a valid ATF XML file.
options:
Various import options applicable to the ATF XML format. If null, all options will be set to their respective default values.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ATFXMLImportOptions)
Imports an ATF XML file into the project document.
file:
Full path of the file to import. File must exist and must be a valid ATF XML file.
options:
Various import options applicable to the ATF XML format. If null, all options will be set to their respective default values.
Returns:
Returns the element Id of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ATFSATExportOptions)
Exports the document to the ATF SAT format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the SAT file to export. If it doesn't end with ".sat", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the SAT format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The viewId in provided export options is not an id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ATFXMLExportOptions)
Exports the document to the ATF XML format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the ATFXML file to export. If it doesn't end with ".atfx", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the ATF XML format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The viewId in provided export options is not an id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.

Autodesk.Revit.DB.Document.SaveAsCloudModel(Autodesk.Revit.DB.ForgeDM.CloudFolder,System.String)
Saves current non-workshared or workshared model as a cloud model or workshared cloud model in BIM 360 Docs or Autodesk Docs.
Remarks:
Assumes that user is currently signed in BIM 360 Docs or Autodesk Docs and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
You can use one of the following methods to save a local model as a workshared cloud model in BIM 360 Docs or Autodesk Docs.
If the local model is a workshared model, then it will be a workshared cloud model after you use this method successfully.  If the local model is a non-workshared model, you can enable the workset with Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String) and then save as a workshared cloud model.  If the local model is a non-workshared model, and you have already saved it as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs, you can still enable the workset with
Autodesk.Revit.DB.Document.EnableCloudWorksharing to convert it to a workshared cloud model.
You cannot save a local workshared model as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs.
cloudFolder:
The Folder from ForgeDM to save the model.
modelName:
Model name in BIM 360 Docs or Autodesk Docs to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
modelName is an empty string.
-or-
The input file name "modelName" does not represent a valid file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelMissingException:
Failed due to the region of the input CloudFolder is invalid.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Saving is not allowed in the current application mode.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is a cloud model, cannot be saved as a cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Failed due to the input CloudFolder containing a BIM 360 Docs or Autodesk Docs account Id or project Id is invalid or unmatched.
-or-
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException:
Failed due to there is a model with the same name already exists at the specified location.
Throws Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException:
Failed due to the model name is breaking project naming convention.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You don't have the entitlement to perform the operation to this this Document.
-or-
User is not authorized to access the specified cloud project.
Since:
2022

Autodesk.Revit.DB.Document.PublishCoordinates(Autodesk.Revit.DB.LinkElementId)
Publish coordinates to the specified ProjectLocation of the link instance.
Remarks:
The host project's True North and shared origin are recorded in the linked project, based on the current position of the linked instance.
This location is now named in both the host project and the linked project. More than one position of the link can be recorded.
When you publish shared coordinates from a host Revit project to a linked DWG, this changes the linked DWG. The origin of the host Revit
project's shared coordinate system becomes the origin of a new User Coordinate System (UCS) in the DWG file. The Y axis of the new UCS corresponds
to the host project's True North. You can name the UCS when you publish coordinates. It is not recommended that you change this name after
publishing coordinates.
Note: Currently, only RevitLinkInstance is supported. DWG link instance, which is
ImportInstance is not supported now. Passing in an locationId that points to an ImportInstance
would result an ArgumentException.
locationId:
The ElementId of the ProjectLocation in the
linked document, to which the transform would be published to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
locationId does not contain a valid linkInstanceId.
-or-
Only RevitLinkInstance is supported through API for publish coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a project document.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Attempting to publish shared coordinates to a cloud based link which is treated as read-only.
-or-
Failed to publish coordinates to the specified ProjectLocation of the link instance.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Document.AcquireCoordinates(Autodesk.Revit.DB.ElementId)
Acquires coordinates from the specified link instance.
Remarks:
When you acquire coordinates from the linked model, the shared coordinates of the linked model become the
shared coordinates of the host model, based on the position of the linked model instance in the host model.
There is no change to the host model's internal coordinates.
The host model also acquires True North from the linked model. The origin of the linked model's shared
coordinates becomes the origin of the host model's shared coordinates.
When a Revit model acquires coordinates from a linked DWG file, the World Coordinate System (WCS) of the
selected linked DWG file becomes the shared coordinate system of the host Revit model, based on the position
of the linked DWG instance. The Y axis of the DWG becomes True North, and the origin of the DWG becomes the
origin of the shared coordinate system of the Revit model.
On acquiring coordinates from a geo-referenced model, the geolocation information will be pulled from the linked
model to the host model.
Unlike UI operation Acquire Coordinates, calling the API would always overwrite the geolocation information in the
host model even if it is different from the one in the linked model, or the linked model has empty geolocation information
(in which case the geolocation information in the host model would be removed).
linkInstanceId:
The ElementId of the link instance (such as
RevitLinkInstance or ImportInstance)
from which the coordinates would be acquired.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element linkInstanceId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a project document.
-or-
This Document has is in an edit mode or is in family mode.
-or-
The coordinate system of the selected model are the same as the host model.
-or-
Cannot acquire coordinates from a model placed multiple times.
-or-
Failed to acquire coordinates from the link instance.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Document.SynchronizeWithCentral(Autodesk.Revit.DB.TransactWithCentralOptions,Autodesk.Revit.DB.SynchronizeWithCentralOptions)
Performs reload latest until the model in the current session is up to date and then saves changes back to central.
A save to central is performed even if no changes were made.
transactOptions:
Options to customize behavior accessing the central model.
syncOptions:
Options to customize behavior of SynchronizeWithCentral.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
-or-
Some of the elements you changed in this model are now editable by someone else, or you checked out worksets that were at risk
or relinquished in the central model but not this file.  You cannot synchronize with the central model until the other user
relinquishes these elements without making changes.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
Your data or permissions saving is aborted by another user.
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
The local file is read-only.
It can not be saved before or after synchronizing with central.
-or-
This Document is not a workshared document.
-or-
Saving local before first reload latest and after saving changes to central
in Synchronize with Central is mandatory for server-based local models.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Synchronize With Central was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be reached
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
The disk space is running low on server, please contact the server administrator.
-or-
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.ReloadLatest(Autodesk.Revit.DB.ReloadLatestOptions)
Fetches changes from central (due to one or more synchronizations with central)
and merges them into the current session.
Remarks:
After this call finishes, use hasAllChangesFromCentral to confirm that there were no
Synchronizations with Central performed during execution of ReloadLatest.
reloadOptions:
Various options to control behavior of reloadLatest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed. Try again.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is not a local model: it is not workshared or is central.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Reload Latest was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.GBXMLExportOptions)
Export the model in gbXML (green-building) format.
Remarks:
This export operation will operate on the main EnergyAnalysisDetailModel in the document, if it exists (see EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel()).
If it does not exist, or if the requested ExportEnergyModelType does not match the type of the main EnergyAnalysisDetailModel, this function will fail.
If you need to export a model with different settings or type than the current main energy model in the document, you should delete the current main energy model, update the EnergyAnalysisSettings, and regenerate the energy model.
If the EnergyDataSettings is set to use conceptual models, this function cannot be used. Instead use Autodesk::Revit::DB::Document::Export(String, String, MassGBXMLExportOptions).
folder:
Indicates the path of a folder where to export the gbXML file.
name:
Indicates the name of the gbXML file to export. If it doesn't end with ".xml", extension ".xml" will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Options which control the contents of the export.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is not valid for exporting gbXML files.
-or-
The name is empty or not valid for exporting gbXML files.
-or-
Analysis type is invalid. For AnalysisMode.ConceptualMasses, use Document.Export(String, String, MassGBXMLExportOptions).
-or-
There is no main EnergyAnalysisDetailModel in the document, or the current main EnergyAnalysisDetailModel is not compatible with the option set in the GBXMLExportOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Exporting is not allowed in the current application mode.
-or-
Export is temporarily disabled.

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.AXMImportOptions,Autodesk.Revit.DB.View)
Imports an AXM file into the document.
file:
Full path of the file to import. File must exist and must be a valid AXM file.
options:
Various import options applicable to the AXM format. If null, all options will be set to their respective default values.
Import FormIt support Preserve color mode, center-to-center and origin-to-origin placement, other options are not supported.
Import FormIt does not support this view only option.
pDBView:
View used to aid placement of the imported file. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for AXM import (.axm files are valid).
-or-
The provided view is not valid for the options provided.
-or-
Visible layer only option is not false or layers are specified in SetLayerSelection.
-or-
Import levels is only supported in project document or conceptual mass document for AXM import.
-or-
Not all AXM import option settings are valid. For more details, please refer to AXMImportOptions.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The AXM Import/Link module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.STLImportOptions,Autodesk.Revit.DB.View)
Imports an STL file into the document.
file:
Full path of the file to import. File must exist and must be a valid STL file.
options:
Various import options applicable to the STL format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STL import (.stl files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The STL Import module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.OBJImportOptions,Autodesk.Revit.DB.View)
Imports an OBJ file into the document.
file:
Full path of the file to import. File must exist and must be a valid OBJ file.
options:
Various import options applicable to the OBJ format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for OBJ import (.obj files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The OBJ Import module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Export(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.PDFExportOptions)
Exports a selection of views in PDF format.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
viewIds:
Selection of ordered views to be exported.
The list must contain at least one valid view.
options:
Various options applicable to the PDF format.
Returns:
True if all specified views are exported successfully,
False if exporting of any view fails, even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentException:
non empty list of views must be provided.
-or-
NullOrEmpty
-or-
There comes duplicated views in viewIds
-or-
some of the views are not printable (exportable).
-or-
Thrown when one or more input arguments are invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Thrown when the target PDF file is inaccessible, e.g. already opened.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2022

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.OBJExportOptions)
Exports a view specified in the export options to the OBJ format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the OBJ file to export. If it doesn't end with ".obj", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the OBJ format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The viewId in provided export options is not an id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.STLExportOptions)
Exports a view specified in the export options to the STL format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the STL file to export. If it doesn't end with ".stl", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the STL format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The viewId in provided export options is not an id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.
Since:
2021.1

Autodesk.Revit.DB.Document.EnableCloudWorksharing
Enables cloud worksharing for a cloud model
Remarks:
This operation will convert an existing cloud model to a workshared cloud model.
This method cannot be used if current model is not a cloud model.
This method cannot be used if the current user doesn't have the workshared cloud model entitlement.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the cloud model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The model in cloud is missing.
-or-
The model in cloud is incompatible.
-or-
The model in cloud is corrupt or not an RVT file.
-or-
The model in cloud was rolled back.
-or-
An internal error happened on the model in cloud , please contact the administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local cache.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
The file is read-only, can not be saved.
-or-
The cloud model does not allow cloud worksharing to be enabled.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that conversion fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You do not have workshared cloud model entitlement to access this resource in cloud
-or-
User is not authorized to access the specified cloud project.
Since:
2019.2

Autodesk.Revit.DB.Document.SaveAsCloudModel(System.Guid,System.Guid,System.String,System.String)
Saves current non-workshared or workshared model as a cloud model or workshared cloud model in BIM 360 Docs or Autodesk Docs.
Remarks:
Assumes that user is currently signed in BIM 360 Docs or Autodesk Docs and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
You can use one of the following methods to save a local model as a workshared cloud model in BIM 360 Docs or Autodesk Docs.
If the local model is a workshared model, then it will be a workshared cloud model after you use this method successfully.  If the local model is a non-workshared model, you can enable the workset with Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String) and then save as a workshared cloud model.  If the local model is a non-workshared model, and you have already saved it as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs, you can still enable the workset with
Autodesk.Revit.DB.Document.EnableCloudWorksharing to convert it to a workshared cloud model.
You cannot save a local workshared model as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs.
accountId:
The BIM 360 Docs or Autodesk Docs account Id.
You can use one of the following methods to get this Id:
If you get the hub Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.  If you get the account Id with Forge BIM 360 Docs or Autodesk Docs API, just convert the Id string to a Guid.
projectId:
The BIM 360 Docs or Autodesk Docs project Id.
You can use one of the following methods to get this Id:
If you get the project Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.  If you get the project Id with Forge BIM 360 Docs or Autodesk Docs API, just convert the Id string to a Guid.
folderId:
Folder identity in BIM 360 Docs or Autodesk Docs to save the model.
You can use one of the following methods to get this Id:
The folder Id string from Forge Data Management API.  The folder Id string from Forge BIM 360 Docs or Autodesk Docs API.
modelName:
Model name in BIM 360 Docs or Autodesk Docs to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
folderId is an empty string.
-or-
modelName is an empty string.
-or-
The input file name "modelName" does not represent a valid file name.
-or-
Thrown when the input BIM 360 Docs or Autodesk Docs account Id or project Id is invalid or unmatched.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Saving is not allowed in the current application mode.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is a cloud model, cannot be saved as a cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException:
Failed due to there is a model with the same name already exists at the specified location.
Throws Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException:
Failed due to the model name is breaking project naming convention.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You don't have the entitlement to perform the operation to this this Document.
-or-
User is not authorized to access the specified cloud project.
Since:
2021

Autodesk.Revit.DB.Document.SaveCloudModel
Saves cloud model.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Could be for any of the reasons that related to access to the cloud model.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that fails with CentralModelException, for example, a central model with that name
is already associated to the specified cloud project.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
The file is read-only, can not be saved.
-or-
This Document is a not cloud model, cannot execute this operation.
-or-
This Document is a workshared document.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Synchronize With Central was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that save fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Since:
2019.2

Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String)
Enables worksharing in the document.
Remarks:
The document's Undo history will be cleared by this command. As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction) that were explicitly started must be finished prior to calling this method.
worksetNameGridLevel:
Name of workset for grids and levels.
worksetName:
Name of workset for all other elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
worksetNameGridLevel is an empty string.
-or-
worksetName is an empty string.
-or-
worksetNameGridLevel cannot include prohibited characters.
-or-
worksetName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document does not allow worksharing to be enabled.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is a workshared document.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Enabling worksharing was cancelled.
Since:
2014